Revit 2027 API
ExternalDataManagerTool.CommandId Property
 The id of the root command represented by this tool item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerCommandId CommandId { get; set; }
Public Property CommandId As ExternalDataManagerCommandId
	Get
	Set
public:
property ExternalDataManagerCommandId^ CommandId {
	ExternalDataManagerCommandId^ get ();
	void set (ExternalDataManagerCommandId^ value);
}
member CommandId : ExternalDataManagerCommandId with get, set
Property Value
ExternalDataManagerCommandId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace